platform: "ensemble"
max_batch_size: 8

input [
  {
    name: "IMAGE"
    data_type: TYPE_FP32
    dims: [12, 480, 480]
  }
]
output {
    name: "PROCESSED_INPUT"
    data_type: TYPE_FP32
    dims: [12, 480, 480]
  }


ensemble_scheduling {
  step [
    {
      model_name: "ensemble_py_step"
      model_version: 1
      input_map {
        key: "input_img"
        value: "IMAGE"
      }
      output_map {
        key: "processed_input"
        value: "PROCESSED_INPUT"
      }
    }
    ]
}